podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/MTBDWT_MKE15Z7.svd.xml
<!--
Devices using this peripheral: 
      MKE14Z7
      MKE15Z7
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "MTBDWT_MKE15Z7" ?>
         <name>MTBDWT</name>
         <description>MTB data watchpoint and trace</description>
         <groupName>MTBDWT</groupName>
         <prependToName>MTBDWT_</prependToName>
         <headerStructName>MTBDWT</headerStructName>
         <baseAddress>0xF0001000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFC8</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>MTB DWT Control Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetValue>0x2F000000</resetValue>
               <fields>
                  <field>
                     <name>DWTCFGCTRL</name>
                     <description>DWT configuration controls</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
                  <field>
                     <name>NUMCMP</name>
                     <description>Number of comparators</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>2</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>COMPARATOR,@p@f@i</name>
               <addressOffset>0x20</addressOffset>
               <register>
                  <name>COMP</name>
                  <description>MTB_DWT Comparator Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>COMP</name>
                        <description>Reference value for comparison</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MASK</name>
                  <description>MTB_DWT Comparator Mask Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>MASK</name>
                        <description>MASK</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FCT</name>
                  <description>MTB_DWT Comparator Function Register 0</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>FUNCTION</name>
                        <description>Function</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0000</name>
                              <description>Disabled</description>
                              <value>0b0000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0100</name>
                              <description>Instruction fetch</description>
                              <value>0b0100</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0101</name>
                              <description>Data operand read</description>
                              <value>0b0101</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0110</name>
                              <description>Data operand write</description>
                              <value>0b0110</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0111</name>
                              <description>Data operand (read + write)</description>
                              <value>0b0111</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DATAVMATCH</name>
                        <description>Data Value Match</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Perform address comparison</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Perform data value comparison</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DATAVSIZE</name>
                        <description>Data Value Size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>00</name>
                              <description>Byte</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>01</name>
                              <description>Halfword</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10</name>
                              <description>Word</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>11</name>
                              <description>Reserved. Any attempts to use this value results in UNPREDICTABLE behavior</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DATAVADDR0</name>
                        <description>Data Value Address 0</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>MATCHED</name>
                        <description>Comparator match</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>No match</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Match occurred</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>TBCTRL</name>
               <description>MTB_DWT Trace Buffer Control Register</description>
               <addressOffset>0x200</addressOffset>
               <resetValue>0x20000000</resetValue>
               <fields>
                  <field>
                     <name>ACOMP0</name>
                     <description>Action based on Comparator 0 match</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Trigger TSTOP based on the assertion of MTBDWT_FCT0[MATCHED]</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Trigger TSTART based on the assertion of MTBDWT_FCT0[MATCHED]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACOMP1</name>
                     <description>Action based on Comparator 1 match</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Trigger TSTOP based on the assertion of MTBDWT_FCT1[MATCHED]</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Trigger TSTART based on the assertion of MTBDWT_FCT1[MATCHED]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NUMCOMP</name>
                     <description>Number of Comparators</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICECFG</name>
               <description>Device Configuration Register</description>
               <addressOffset>0xFC8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEVICECFG</name>
                     <description>DEVICECFG</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICETYPID</name>
               <description>Device Type Identifier Register</description>
               <addressOffset>0xFCC</addressOffset>
               <access>read-only</access>
               <resetValue>0x4</resetValue>
               <fields>
                  <field>
                     <name>DEVICETYPID</name>
                     <description>DEVICETYPID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>4,5,6,7,0,1,2,3</dimIndex>
               <name>PERIPHID%s</name>
               <description>Peripheral ID Register</description>
               <addressOffset>0xFD0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PERIPHID</name>
                     <description>PERIPHID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>COMPID%s</name>
               <description>Component ID Register</description>
               <addressOffset>0xFF0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>COMPID</name>
                     <description>Component ID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
